# Introduction
This is a test for doing some basic ETL on data.

## The Goal
The goal of this task is to take a pair excel files, load them into SQL, and then transform the dataset into a separate schema (called FHIR).

### Input data
The input data is an pair of excel files with patient information in it. Each file represents an extract of a data system, each made a month apart. Each file includes patients discharged during the last two months, so the data will have intersecting data points, but the union of the two is really what you want.  In the boilerplate code below, you can see the file paths and open them up in excel to browse it if you'd like. Feel free to ask questions about the file formatting.

# Exercise

## Load into SQL
First, begin by loading the data into a SQL database. We have Postgres running for you already, so use that. 
Username: carta
Password: password

The data should be a union of the data in both extract files, with an update time corresponding to the newest update date available for each row.

## Transform into FHIR

After the data is loaded into SQL, you'll produce some FHIR resources from the data. In particular, there are two resources you'll make:

1) Patient
2) Encounter

Both of those are defined on the FHIR website, here: http://fhir.org. We will do a validation on the data once it's done!

In [2]:
import pandas as pd
import numpy as np
from carta_interview import Datasets, get_data_file

In [3]:
patient_extract1 = get_data_file(Datasets.PATIENT_EXTRACT1)
patient_extract2 = get_data_file(Datasets.PATIENT_EXTRACT2)

In [4]:
# view the data files before loading into the database 

patient_data1 = pd.read_excel(patient_extract1)
patient_data2 = pd.read_excel(patient_extract2)

In [5]:
patient_data1.head()

,MRN,Encounter ID,First Name,Last Name,Birth Date,Admission D/T,Discharge D/T,Update D/T
0,1,1234,John,Doe,01/02/1999,04/12/2002 5:00 PM,04/13/2002 10:00 PM,04/24/2002 6:00 AM
1,2,2345,Joanne,Lee,04/19/2002,04/19/2002 7:22 PM,04/20/2002 6:22 AM,04/24/2002 6:00 AM
2,3,3456,Annabelle,Jones,01/02/2001,04/21/2002 5:00 PM,04/23/2002 2:53 AM,04/24/2002 6:00 AM

In [6]:
patient_data2.head()

,MRN,Encounter ID,First Name,Last Name,Birth Date,Admission D/T,Discharge D/T,Update D/T
0,20,987,Jerry,Jones,01/02/1988,05/01/2002 2:00 PM,05/02/2002 9:00 PM,05/17/2002 6:00 AM
1,2,2345,Cosmia,Lee,04/19/2002,04/19/2002 7:22 PM,04/20/2002 6:22 AM,05/17/2002 6:00 AM
2,3,3456,Annabelle,Jones,01/02/2001,04/21/2002 5:00 PM,04/23/2002 2:53 AM,05/17/2002 6:00 AM

In [7]:
patient_data1.describe().transpose()

              count    mean     std     min     25%     50%     75%     max
MRN             3.0     2.0     1.0     1.0     1.5     2.0     2.5     3.0
Encounter ID    3.0  2345.0  1111.0  1234.0  1789.5  2345.0  2900.5  3456.0

In [8]:
patient_data2.describe().transpose()

,count,mean,std,min,25%,50%,75%,max
MRN,3.0,8.333333,10.115994,2.0,2.5,3.0,11.5,20.0
Encounter ID,3.0,2262.666667,1236.557453,987.0,1666.0,2345.0,2900.5,3456.0

### Summary so far

We have two patient extracts. Each of the patient extracts has 3 records. Each record has the following fields 'MRN','Encounter ID','First Name','Last Name','Birth Date','Admission D/T','Discharge D/T','Update D/T'. Here only 2 fields are numeric and rest are either Categorical or Date. 

As mentioned in the earlier section we do see same records in both the extracts. We will filter the data before loading onto the database.First make a union of both the patient extracts and then sort it based on the update time and then load it onto the database.

In [9]:
# combine the tables

patient_data_combined = pd.concat([patient_data1, patient_data2])

In [10]:
patient_data_combined

,MRN,Encounter ID,First Name,Last Name,Birth Date,Admission D/T,Discharge D/T,Update D/T
0,1,1234,John,Doe,01/02/1999,04/12/2002 5:00 PM,04/13/2002 10:00 PM,04/24/2002 6:00 AM
1,2,2345,Joanne,Lee,04/19/2002,04/19/2002 7:22 PM,04/20/2002 6:22 AM,04/24/2002 6:00 AM
2,3,3456,Annabelle,Jones,01/02/2001,04/21/2002 5:00 PM,04/23/2002 2:53 AM,04/24/2002 6:00 AM
0,20,987,Jerry,Jones,01/02/1988,05/01/2002 2:00 PM,05/02/2002 9:00 PM,05/17/2002 6:00 AM
1,2,2345,Cosmia,Lee,04/19/2002,04/19/2002 7:22 PM,04/20/2002 6:22 AM,05/17/2002 6:00 AM
2,3,3456,Annabelle,Jones,01/02/2001,04/21/2002 5:00 PM,04/23/2002 2:53 AM,05/17/2002 6:00 AM

In [11]:
# we see above that there is one duplicate record, so remove that record and then sort the data by update date

patient_data_combined.drop_duplicates(['First Name','Last Name'], inplace=True)
patient_data_combined.sort_values(by='Update D/T')
patient_data_combined.reset_index(drop=True, inplace=True)

In [12]:
# transformed data 

patient_data_combined

,MRN,Encounter ID,First Name,Last Name,Birth Date,Admission D/T,Discharge D/T,Update D/T
0,1,1234,John,Doe,01/02/1999,04/12/2002 5:00 PM,04/13/2002 10:00 PM,04/24/2002 6:00 AM
1,2,2345,Joanne,Lee,04/19/2002,04/19/2002 7:22 PM,04/20/2002 6:22 AM,04/24/2002 6:00 AM
2,3,3456,Annabelle,Jones,01/02/2001,04/21/2002 5:00 PM,04/23/2002 2:53 AM,04/24/2002 6:00 AM
3,20,987,Jerry,Jones,01/02/1988,05/01/2002 2:00 PM,05/02/2002 9:00 PM,05/17/2002 6:00 AM
4,2,2345,Cosmia,Lee,04/19/2002,04/19/2002 7:22 PM,04/20/2002 6:22 AM,05/17/2002 6:00 AM

In [14]:
from sqlalchemy import create_engine
engine = create_engine('postgresql://carta:password@localhost/')

### Load into SQL

The transformed data to be loaded onto the database

In [15]:
# load the dataframe onto the database

patient_data_combined.to_sql('patient_data', engine)

In [16]:
# check if the data is loaded

pd.read_sql_query("SELECT * from patient_data", engine)

,index,MRN,Encounter ID,First Name,Last Name,Birth Date,Admission D/T,Discharge D/T,Update D/T
0,0,1,1234,John,Doe,01/02/1999,04/12/2002 5:00 PM,04/13/2002 10:00 PM,04/24/2002 6:00 AM
1,1,2,2345,Joanne,Lee,04/19/2002,04/19/2002 7:22 PM,04/20/2002 6:22 AM,04/24/2002 6:00 AM
2,2,3,3456,Annabelle,Jones,01/02/2001,04/21/2002 5:00 PM,04/23/2002 2:53 AM,04/24/2002 6:00 AM
3,3,20,987,Jerry,Jones,01/02/1988,05/01/2002 2:00 PM,05/02/2002 9:00 PM,05/17/2002 6:00 AM
4,4,2,2345,Cosmia,Lee,04/19/2002,04/19/2002 7:22 PM,04/20/2002 6:22 AM,05/17/2002 6:00 AM

### Transform into FHIR

As per my understanding FHIR is a specification. Here we want two to create two resources. One if for patient and the other is for encounter. Both these resources has format specified. We will get the data from the database and then create the JSON object as per the specification.

In [18]:
# get data from the database

import sqlalchemy as db

engine = db.create_engine('postgresql://carta:password@localhost/')
connection = engine.connect()
metadata = db.MetaData()
patient_data = db.Table('patient_data', metadata, autoload=True, autoload_with=engine)

In [19]:
query = db.select([patient_data]).where(patient_data.columns.MRN == 3)
result = connection.execute(query)

In [27]:
temp_list = []
for i in result:
    temp_list.append(i)

In [30]:
# create a patient resource 
import json

temp_dict = {"First Name": temp_list[0][3],
            "Last Name":temp_list[0][4],
            "Birth Date":temp_list[0][5],
            "Admission D/T":temp_list[0][6],
            "Discharge D/T":temp_list[0][7],
            "Update D/T":temp_list[0][8]}

patient_resource = json.dumps(temp_dict)

In [31]:
patient_resource

'{"First Name": "Annabelle", "Last Name": "Jones", "Birth Date": "01/02/2001", "Admission D/T": "04/21/2002 5:00 PM", "Discharge D/T": "04/23/2002 2:53 AM", "Update D/T": "04/24/2002 6:00 AM"}'